/**
 * Пакет, содержащий клиенты и компоненты для взаимодействия с внешними сервисами.
 * Включает Feign-клиенты для взаимодействия с удаленными сервисами, а также другие компоненты,
 * необходимые для обеспечения связи и обработки ответов от удаленных сервисов.
 * Feign-клиент для взаимодействия с сервисом аутентификации.
 * Предоставляет методы для отправки запросов к сервису аутентификации,
 * такие как получение информации о пользователях
 * по списку email и получение email по идентификатору аккаунта.
 */
package business.hub.userinfoservice.client;

